[
  {
    "id": "storeItem01",
    "subtitle": "THE HEAT IS HERE",
    "title": "SUMMER STYLE ROUNDUP",
    "date": "July 20, 2019",
    "picture": "https://66.media.tumblr.com/1c575fcc412aa6324c3f3410b0842b89/tumblr_inline_pc6ikoTnHy1tqbnky_500.jpg",
    "description": [
      "The heat is here! With the summer season in full swing, whether you’re outside embracing the warm rays or inside enjoying the company of your beloved AC, we’ve got you covered. Here is a round up of some of our Stylegarage summer favourites worthy of a spot in your home both indoor and outdoor.Crafted locally in Toronto, our collection of made-to-order pieces – Stylegarage Originals – is always expanding, often inspired by our very own clients who share their ideas about what they would love to see in their own homes.The Marcelle Collection will make you feel like you’ve transported to your very own Parisian pied-de-terre this summer. Cozy and effortlessly chic, this piece can come as a stand- alone sofa or as sectional by pairing it with a chaise for maximum feet-up comfort.The Sommelier Credenza is the perfect way to hold you favourite vintages and spark conversation any entertainment space. Customize the configuration and make it your own, with a selection of rich woods, stones and finishes.Perfect for your patio, the Rapson Cocktail Table by Loll Design is part of a collection inspired by midcentury architect Ralph Rapson. Sculptural and sleek, yet low maintenance and easy to clean, this piece is made entirely from recycled plastic in your choice of a variety of colours.This summer we’ve also introduced new products by Toronto-based design studio, Castor. A winner of several design awards and a Stylegarage staff favourite – the Induction Light Tube operates using a magnetic field to transfer electrical current from the cube shaped base to a regular fluorescent light bulb.The Lily Table by Good Thing functions as a stackable indoor/outdoor side table, and when pulled up to a sofa or chair can be used as a mobile work/snack station. We appreciate the versatility, but we also love the fun silhouette and the fresh shades of colours."
    ]
  },
  {
    "id": "storeItem02",
    "subtitle": "KITCHEN ISLAND",
    "title": "MEET ROSSEAU ISLAND",
    "date": "April 26, 2019",
    "picture": "https://66.media.tumblr.com/dca7ae311962b5667f34a8c296f47bf3/tumblr_inline_p7t72m9G4d1tqbnky_540.jpg",
    "description": "Introducing the all-new made-to-order Rousseau Island, a fresh solution for any kitchen, from cottage to condo. Simple, finally.A natural, rough-sawn oak top provides both a dining and a prep surface, while a deceptively monolithic steel base provides hidden storage for all of the things that usually have nowhere to go. Made locally to custom order.Choose from a variety of top options, including wood, marble and concrete. We’ll build it locally to your custom dimensions – by hand, just for you. Get in touch to learn more or place your order!"
  },
  {
    "id": "storeItem03",
    "subtitle": "THE COASTAL COLLECTION",
    "title": "A SEE BREEZE IS BLOWING.",
    "date": "August 18, 2019",
    "picture": "https://66.media.tumblr.com/396a584835c9cf350d4ec3b7a3697e9f/tumblr_ouw6mk9h1l1uqebcqo1_1280.jpg",
    "description": "Welcoming an airy new collection inspired by coastal life.A beach house should be filled with dappled light, fresh air, and comfy furniture that you can collapse into after a long swim. Why not bring that same breezy feeling home with you? With exposed french seams and plush down-filled upholstery, our Coastal Collection will make you feel like you’re at the seaside all year long. Natural, breathable, and cloud-soft—our linen and cotton-blend fabrics invite you to slow down, and maybe doze the afternoon away.Discover the North Shore, Big Sur, Dune and Cove at Stylegarage today."
  },
  {
    "id": "storeItem04",
    "subtitle": "ECO-FRIENDLY INTERIOR",
    "title": "WE'RE GREENER THAN EVER",
    "date": "July 29, 2018",
    "picture": "https://66.media.tumblr.com/8025d249e2582652113f631266caf78d/tumblr_inline_otuvmq9zyw1tqbnky_500.jpg",
    "description": "Sustainable Lumber, Did you know that every Gus* sofa features a kiln-dried 100% FSC®-Certified hardwood frame? That’s right, all of your favourite styles are constructed from sustainable lumber sourced from responsibly managed forests. It’s the perfect beginning to this green story – and it only gets better. Vegan Down,The plushest sofas from Gus* Modern now use PET-fill – a soft, pillowy fibre that’s a huge improvement over natural down. Unlike traditional down, PET is made from thousands of recycled plastic water bottles. According to our friends at Gus*, this innovative material diverts around 600,000 plastic bottles from landfills each year.What’s more, PET-fill helps upholstery keep its shape longer, and won’t poke you with features while you’re snuggling. Check out the Gus* Parkdale and Logan sofas to feel the bounce for yourself. You won’t believe it’s not down – and now 20% off during the Gus* Summer Sale! Flame Retardant-Free,Other furniture makers might have stopped there, but not Gus*. All of their sofas are made without the use of flame retardants in the upholstery foam. However, their collection still meets California TB117-2013 fire safety standards. So, your family will be safe from hazardous chemicals, as will the environment.Come talk to our sales team about how Gus* Modern sofas are making the other guys green with envy."
  }
]
